hdfs-demo.org
#+TITLE: HDF5 Virtual File Driver for HDFS - Demonstration
#+AUTHOR: Gerd Heber
#+EMAIL: gheber@hdfgroup.org
#+DATE: 2018-09-26
#+PROPERTY: header-args :eval never-export :results output :exports both :session one

This demonstration will show you how to:

1. Copy an HDF5 file into an HDFS file system
2. List the file structure by running =h5ls=
3. Print detailed information by running =h5dump=
4. Extract data from a dataset with =h5dump=
5. Use Hadoop Streaming to collect data from multiple HDF5 files

Before you proceed, please review the following prerequisites.

* Prerequisites

  - A version of the HDF5 library (HDF5 1.10.4 or later) with the HDFS Virtual
    File Driver (VFD) enabled
  - A compatible version of Hadoop (e.g., 3.1.1)
  - An HDFS file system (a cluster or local installation)

  With these prerequisites in place, make sure that your environment is
  configured for the dependencies (Java, Hadoop).


* Environment

  The HDF5 VFD for HDFS, whether used in your own application or with
  HDF5 command line tools, depends on certain environment variables and
  shared libraries.

  Please ensure that =JAVA_HOME=, =HADOOP_HOME=, and =CLASSPATH= reflect your
  environment. An example is provided below:

  #+BEGIN_SRC shell :results silent
  export JAVA_HOME=/usr/lib/jvm/java-openjdk
  export HADOOP_HOME=$HOME/work/hadoop-3.1.1
  export CLASSPATH=`$HADOOP_HOME/bin/hadoop classpath --glob`
  #+END_SRC

  The HDFS VFD depends on the following shared libraries: =libhdf5.so=,
  =libhdfs.so=, =libjvm.so=. Please locate these dependencies and configure
  the =LD_LIBRARY_PATH= accordingly. An example is shown below:

  #+BEGIN_SRC shell :results silent
  export LD_LIBRARY_PATH=$JAVA_HOME/jre/lib/amd64/server:$LD_LIBRARY_PATH
  export LD_LIBRARY_PATH=$HADOOP_HOME/lib/native:$LD_LIBRARY_PATH
  export LD_LIBRARY_PATH=$HOME/.local/lib:$LD_LIBRARY_PATH
  #+END_SRC

  For convenience, we add the directories containing the Hadoop and HDF5
  command line tools to our =PATH= environment variable.

  #+BEGIN_SRC shell :results silent
  export PATH=$HADOOP_HOME/bin:$HOME/.local/bin:$PATH
  #+END_SRC

  To get started you need to know the host name and port of the HDFS namenode.
  In the examples below, the host name is =jelly.ad.hdfgroup,org= and the port
  number is 8020. Verify the availability of an HDFS file system via the
  =hdfs dfs -ls= command:

  #+BEGIN_SRC shell
  hdfs dfs -ls hdfs://jelly.ad.hdfgroup.org:8020/
  #+END_SRC

  #+RESULTS:
  : Found 5 items
  : drwxrwxrwx   - hdfs  supergroup          0 2016-04-05 21:26 hdfs://jelly.ad.hdfgroup.org:8020/benchmarks
  : drwxr-xr-x   - hbase supergroup          0 2016-04-05 21:26 hdfs://jelly.ad.hdfgroup.org:8020/hbase
  : drwxrwxrwt   - hdfs  supergroup          0 2018-10-25 09:55 hdfs://jelly.ad.hdfgroup.org:8020/tmp
  : drwxr-xr-x   - hdfs  supergroup          0 2018-10-10 16:14 hdfs://jelly.ad.hdfgroup.org:8020/user
  : drwxr-xr-x   - hdfs  supergroup          0 2016-04-05 21:27 hdfs://jelly.ad.hdfgroup.org:8020/var


* Demonstration

** Copying an HDF5 file to HDFS

   If you have an existing HDF5 or NetCDF-4 file, you can skip this step.
   If you don't have an HDF5 file, it's easy to create one via =h5mkgrp=:

   #+BEGIN_SRC shell
   h5mkgrp -p sample.h5 /A/few/groups
   ls -al sample.h5
   #+END_SRC

   #+RESULTS:
   :
   : -rw-r--r--. 1 gheber hdf 3896 Oct 25 10:22 sample.h5

   Copy your example file or =sample.h5= to HDFS as follows:

   #+BEGIN_SRC shell
   hdfs dfs -copyFromLocal sample.h5 hdfs://jelly.ad.hdfgroup.org/tmp
   hdfs dfs -ls hdfs://jelly.ad.hdfgroup.org/tmp/sample.h5
   #+END_SRC

   #+RESULTS:
   :
   : -rw-r--r--   3 gheber supergroup       3896 2018-10-25 10:23 hdfs://jelly.ad.hdfgroup.org/tmp/sample.h5

   If you do not have the permission to write to HDFS' =/tmp= directory, you
   will see an error message and must choose a target directory, such as
   your home directory (in HDFS), where you have write permission.


