hdfs-demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-25 Thu 10:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HDF5 Virtual File Driver for HDFS - Demonstration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gerd Heber" />

    <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">HDF5 Virtual File Driver for HDFS - Demonstration</h1>
<p>
This demonstration will show you how to:
</p>

<ol class="org-ol">
<li>Copy an HDF5 file into an HDFS file system</li>
<li>List the file structure by running <code>h5ls</code></li>
<li>Print detailed information by running <code>h5dump</code></li>
<li>Extract data from a dataset with <code>h5dump</code></li>
<li>Use Hadoop Streaming to collect data from multiple HDF5 files</li>
</ol>

<p>
Before you proceed, please review the following prerequisites.
</p>

<div id="outline-container-org853556a" class="outline-2">
<h2 id="org853556a">Prerequisites</h2>
<div class="outline-text-2" id="text-org853556a">
<ul class="org-ul">
<li>A version of the HDF5 library (HDF5 1.10.4 or later) with the HDFS Virtual
File Driver (VFD) enabled</li>
<li>A compatible version of Hadoop (e.g., 3.1.1)</li>
<li>An HDFS file system (a cluster or local installation)</li>
</ul>

<p>
With these prerequisites in place, make sure that your environment is
configured for the dependencies (Java, Hadoop).
</p>
</div>
</div>


<div id="outline-container-org9eb45fb" class="outline-2">
<h2 id="org9eb45fb">Environment</h2>
<div class="outline-text-2" id="text-org9eb45fb">
<p>
The HDF5 VFD for HDFS, whether used in your own application or with
HDF5 command line tools, depends on certain environment variables and
shared libraries.
</p>

<p>
Please ensure that <code>JAVA_HOME</code>, <code>HADOOP_HOME</code>, and <code>CLASSPATH</code> reflect your
environment. An example is provided below:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">JAVA_HOME</span>=/usr/lib/jvm/java-openjdk
<span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">HADOOP_HOME</span>=$<span style="color: #BA36A5;">HOME</span>/work/hadoop-3.1.1
<span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">CLASSPATH</span>=<span style="color: #FF1493;">`$HADOOP_HOME/bin/hadoop classpath --glob`</span>
</pre>
</div>

<p>
The HDFS VFD depends on the following shared libraries: <code>libhdf5.so</code>,
<code>libhdfs.so</code>, <code>libjvm.so</code>. Please locate these dependencies and configure
the <code>LD_LIBRARY_PATH</code> accordingly. An example is shown below:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">LD_LIBRARY_PATH</span>=$<span style="color: #BA36A5;">JAVA_HOME</span>/jre/lib/amd64/server:$<span style="color: #BA36A5;">LD_LIBRARY_PATH</span>
<span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">LD_LIBRARY_PATH</span>=$<span style="color: #BA36A5;">HADOOP_HOME</span>/lib/native:$<span style="color: #BA36A5;">LD_LIBRARY_PATH</span>
<span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">LD_LIBRARY_PATH</span>=$<span style="color: #BA36A5;">HOME</span>/.local/lib:$<span style="color: #BA36A5;">LD_LIBRARY_PATH</span>
</pre>
</div>

<p>
For convenience, we add the directories containing the Hadoop and HDF5
command line tools to our <code>PATH</code> environment variable.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0; font-weight: bold;">export</span> <span style="color: #BA36A5;">PATH</span>=$<span style="color: #BA36A5;">HADOOP_HOME</span>/bin:$<span style="color: #BA36A5;">HOME</span>/.local/bin:$<span style="color: #BA36A5;">PATH</span>
</pre>
</div>

<p>
To get started you need to know the host name and port of the HDFS namenode.
In the examples below, the host name is <code>jelly.ad.hdfgroup,org</code> and the port
number is 8020. Verify the availability of an HDFS file system via the
<code>hdfs dfs -ls</code> command:
</p>

<div class="org-src-container">
<pre class="src src-shell">hdfs dfs -ls hdfs://jelly.ad.hdfgroup.org:8020/
</pre>
</div>

<pre class="example">
Found 5 items
drwxrwxrwx   - hdfs  supergroup          0 2016-04-05 21:26 hdfs://jelly.ad.hdfgroup.org:8020/benchmarks
drwxr-xr-x   - hbase supergroup          0 2016-04-05 21:26 hdfs://jelly.ad.hdfgroup.org:8020/hbase
drwxrwxrwt   - hdfs  supergroup          0 2018-10-25 09:55 hdfs://jelly.ad.hdfgroup.org:8020/tmp
drwxr-xr-x   - hdfs  supergroup          0 2018-10-10 16:14 hdfs://jelly.ad.hdfgroup.org:8020/user
drwxr-xr-x   - hdfs  supergroup          0 2016-04-05 21:27 hdfs://jelly.ad.hdfgroup.org:8020/var

</pre>
</div>
</div>


<div id="outline-container-org1024166" class="outline-2">
<h2 id="org1024166">Demonstration</h2>
<div class="outline-text-2" id="text-org1024166">
</div>
<div id="outline-container-orgaae9095" class="outline-3">
<h3 id="orgaae9095">Copying an HDF5 file to HDFS</h3>
<div class="outline-text-3" id="text-orgaae9095">
<p>
If you have an existing HDF5 or NetCDF-4 file, you can skip this step.
If you don't have an HDF5 file, it's easy to create one via <code>h5mkgrp</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">h5mkgrp -p sample.h5 /A/few/groups
ls -al sample.h5
</pre>
</div>

<pre class="example">

-rw-r--r--. 1 gheber hdf 3896 Oct 25 10:22 sample.h5

</pre>

<p>
Copy your example file or <code>sample.h5</code> to HDFS as follows:
</p>

<div class="org-src-container">
<pre class="src src-shell">hdfs dfs -copyFromLocal sample.h5 hdfs://jelly.ad.hdfgroup.org/tmp
hdfs dfs -ls hdfs://jelly.ad.hdfgroup.org/tmp/sample.h5
</pre>
</div>

<pre class="example">

-rw-r--r--   3 gheber supergroup       3896 2018-10-25 10:23 hdfs://jelly.ad.hdfgroup.org/tmp/sample.h5

</pre>

<p>
If you do not have the permission to write to HDFS' <code>/tmp</code> directory, you
will see an error message and must choose a target directory, such as
your home directory (in HDFS), where you have write permission.
</p>
</div>
</div>
