hdfs-demo.org
** Listing the HDF5 file structure via =h5ls=

   The =h5ls= command line tool lists information about objects in an
   HDF5 file. There is no difference in the behavior of =h5ls= between listing
   information about objects in an HDF5 file that is stored in a local
   file system vs. HDFS. There currently one additional required argument,
   =--vfd=hdfs= to tell =h5ls= to use the HDFS VFD instead of the default POSIX
   VFD. Unless the HDFS file system is running on =localhost=, it is also
   necessary to specify the host name and port number of the HDFS namenode
   via the =--hdfs-attrs= option.

   #+BEGIN_SRC shell
   h5ls --vfd=hdfs --hdfs-attrs="(hdfs://jelly.ad.hdfgroup.org,8020,,,)" \
        -r /tmp/sample.h5
   #+END_SRC

   #+RESULTS:
   :
   : /                        Group
   : /A                       Group
   : /A/few                   Group
   : /A/few/groups            Group

   A slightly more complex example is shown below:

   #+BEGIN_SRC shell
   h5ls --vfd=hdfs --hdfs-attrs="(hdfs://jelly.ad.hdfgroup.org,8020,,,)" \
        -r /tmp/efitOut.nc | head -n 50
   #+END_SRC

   #+RESULTS:
   #+begin_example

   /                        Group
   /coords                  Type
   /equilibriumStatus       Dataset {22845}
   /equilibriumStatusInteger Dataset {22845}
   /equilibriumStatusType   Type
   /errorMessageDim         Dataset {20}
   /errorMessages           Dataset {22845, 20}
   /input                   Group
   /input/bVacRadiusProduct Group
   /input/bVacRadiusProduct/values Dataset {22845}
   /input/codeControls      Group
   /input/codeControls/alpgamSwitch Dataset {1}
   /input/codeControls/computeChi2WithWeights Dataset {1}
   /input/codeControls/computeConstraintsWithDz Dataset {1}
   /input/codeControls/fcurrtFit Dataset {1}
   /input/codeControls/fitDzAlgorithm Dataset {1}
   /input/codeControls/lcfsTol Dataset {1}
   /input/constraints       Group
   /input/constraints/diamagneticFlux Group
   /input/constraints/diamagneticFlux/computed Dataset {22845}
   /input/constraints/diamagneticFlux/sigma Dataset {22845}
   /input/constraints/diamagneticFlux/target Dataset {22845}
   /input/constraints/diamagneticFlux/weights Dataset {22845}
   /input/constraints/fluxLoops Group
   /input/constraints/fluxLoops/computed Dataset {22845, 36}
   /input/constraints/fluxLoops/fluxLoopDim Dataset {36}
   /input/constraints/fluxLoops/fluxLoopElementDim Dataset {2}
   /input/constraints/fluxLoops/id Dataset {36}
   /input/constraints/fluxLoops/rValues Dataset {36, 2}
   /input/constraints/fluxLoops/sigmas Dataset {22845, 36}
   /input/constraints/fluxLoops/target Dataset {22845, 36}
   /input/constraints/fluxLoops/toroidalAngleBegin Dataset {36, 2}
   /input/constraints/fluxLoops/toroidalAngleEnd Dataset {36, 2}
   /input/constraints/fluxLoops/weights Dataset {22845, 36}
   /input/constraints/fluxLoops/zValues Dataset {36, 2}
   /input/constraints/ironModel Group
   /input/constraints/ironModel/absoluteError Dataset {1}
   /input/constraints/ironModel/fittingAbsoluteError Dataset {1}
   /input/constraints/ironModel/fittingRelativeError Dataset {1}
   /input/constraints/ironModel/geometry Group
   /input/constraints/ironModel/geometry/Dang Dataset {1, 96}
   /input/constraints/ironModel/geometry/Dang2 Dataset {1, 96}
   /input/constraints/ironModel/geometry/Eang Dataset {1, 96}
   /input/constraints/ironModel/geometry/Eang2 Dataset {1, 96}
   /input/constraints/ironModel/geometry/boundaryCoordsR Dataset {1, 96}
   /input/constraints/ironModel/geometry/boundaryCoordsZ Dataset {1, 96}
   /input/constraints/ironModel/geometry/boundaryIntervalCount Dataset {1}
   /input/constraints/ironModel/geometry/boundaryLength Dataset {1}
   /input/constraints/ironModel/geometry/boundaryNodeCount Dataset {1}
   /input/constraints/ironModel/geometry/boundaryNodeDim Dataset {96}
   #+end_example


** Printing detailed information with =h5dump=

   The =h5dump= command line tool lists detailed information about objects in an
   HDF5 file. There is no difference in the behavior of =h5dump= between listing
   information about objects in an HDF5 file that is stored in a local
   file system vs. HDFS. There currently one additional required argument,
   =--filedriver=hdfs= to tell =h5dump= to use the HDFS VFD instead of the
   default POSIX VFD. Unless the HDFS file system is running on =localhost=, it
   is also necessary to specify the host name and port number of the HDFS
   namenode.

   #+BEGIN_SRC shell
   h5dump --filedriver=hdfs \
          --hdfs-attrs="(hdfs://jelly.ad.hdfgroup.org,8020,,,)" \
          -pB \
          /tmp/sample.h5
   #+END_SRC

   #+RESULTS:
   #+begin_example

   > > HDF5 "/tmp/sample.h5" {
   SUPER_BLOCK {
      SUPERBLOCK_VERSION 0
      FREELIST_VERSION 0
      SYMBOLTABLE_VERSION 0
      OBJECTHEADER_VERSION 0
      OFFSET_SIZE 8
      LENGTH_SIZE 8
      BTREE_RANK 16
      BTREE_LEAF 4
      ISTORE_K 32
      FILE_SPACE_STRATEGY H5F_FSPACE_STRATEGY_FSM_AGGR
      FREE_SPACE_PERSIST FALSE
      FREE_SPACE_SECTION_THRESHOLD 1
      FILE_SPACE_PAGE_SIZE 4096
      USER_BLOCK {
         USERBLOCK_SIZE 0
      }
   }
   GROUP "/" {
      GROUP "A" {
         GROUP "few" {
            GROUP "groups" {
            }
         }
      }
   }
   }
   #+end_example

   A slightly more complex example is shown below:

   #+BEGIN_SRC shell
   h5dump --filedriver=hdfs \
          --hdfs-attrs="(hdfs://jelly.ad.hdfgroup.org,8020,,,)" \
          -pBH /tmp/efitOut.nc | head -n 50
   #+END_SRC

   #+RESULTS:
   #+begin_example

   > HDF5 "/tmp/efitOut.nc" {
   SUPER_BLOCK {
      SUPERBLOCK_VERSION 2
      FREELIST_VERSION 0
      SYMBOLTABLE_VERSION 0
      OBJECTHEADER_VERSION 0
      OFFSET_SIZE 8
      LENGTH_SIZE 8
      BTREE_RANK 16
      BTREE_LEAF 4
      ISTORE_K 32
      FILE_SPACE_STRATEGY H5F_FSPACE_STRATEGY_FSM_AGGR
      FREE_SPACE_PERSIST FALSE
      FREE_SPACE_SECTION_THRESHOLD 1
      FILE_SPACE_PAGE_SIZE 4096
      USER_BLOCK {
         USERBLOCK_SIZE 0
      }
   }
   GROUP "/" {
      ATTRIBUTE "Conventions" {
         DATATYPE  H5T_STRING {
            STRSIZE 20;
            STRPAD H5T_STR_NULLTERM;
            CSET H5T_CSET_ASCII;
            CTYPE H5T_C_S1;
         }
         DATASPACE  SCALAR
      }
      ATTRIBUTE "codeVersion" {
         DATATYPE  H5T_STRING {
            STRSIZE 11;
            STRPAD H5T_STR_NULLTERM;
            CSET H5T_CSET_ASCII;
            CTYPE H5T_C_S1;
         }
         DATASPACE  SCALAR
      }
      ATTRIBUTE "pulseNumber" {
         DATATYPE  H5T_STD_I32LE
         DATASPACE  SIMPLE { ( 1 ) / ( 1 ) }
      }
      DATATYPE "coords" H5T_COMPOUND {
         H5T_IEEE_F64LE "R";
         H5T_IEEE_F64LE "Z";
      }
      DATASET "equilibriumStatus" {
         DATATYPE  "/equilibriumStatusType"
         DATASPACE  SIMPLE { ( 22845 ) / ( 22845 ) }
         STORAGE_LAYOUT {
   #+end_example


