hdfs-demo.html


<div id="outline-container-org31ebd89" class="outline-3">
<h3 id="org31ebd89">Listing the HDF5 file structure via <code>h5ls</code></h3>
<div class="outline-text-3" id="text-org31ebd89">
<p>
The <code>h5ls</code> command line tool lists information about objects in an
HDF5 file. There is no difference in the behavior of <code>h5ls</code> between listing
information about objects in an HDF5 file that is stored in a local
file system vs. HDFS. There currently one additional required argument,
<code>--vfd=hdfs</code> to tell <code>h5ls</code> to use the HDFS VFD instead of the default POSIX
VFD. Unless the HDFS file system is running on <code>localhost</code>, it is also
necessary to specify the host name and port number of the HDFS namenode
via the <code>--hdfs-attrs</code> option.
</p>

<div class="org-src-container">
<pre class="src src-shell">h5ls --vfd=hdfs --hdfs-attrs=<span style="color: #008000;">"(hdfs://jelly.ad.hdfgroup.org,8020,,,)"</span> <span style="color: #008000;">\</span>
     -r /tmp/sample.h5
</pre>
</div>

<pre class="example">

/                        Group
/A                       Group
/A/few                   Group
/A/few/groups            Group

</pre>

<p>
A slightly more complex example is shown below:
</p>

<div class="org-src-container">
<pre class="src src-shell">h5ls --vfd=hdfs --hdfs-attrs=<span style="color: #008000;">"(hdfs://jelly.ad.hdfgroup.org,8020,,,)"</span> <span style="color: #008000;">\</span>
     -r /tmp/efitOut.nc | head -n 50
</pre>
</div>

<pre class="example">

/                        Group
/coords                  Type
/equilibriumStatus       Dataset {22845}
/equilibriumStatusInteger Dataset {22845}
/equilibriumStatusType   Type
/errorMessageDim         Dataset {20}
/errorMessages           Dataset {22845, 20}
/input                   Group
/input/bVacRadiusProduct Group
/input/bVacRadiusProduct/values Dataset {22845}
/input/codeControls      Group
/input/codeControls/alpgamSwitch Dataset {1}
/input/codeControls/computeChi2WithWeights Dataset {1}
/input/codeControls/computeConstraintsWithDz Dataset {1}
/input/codeControls/fcurrtFit Dataset {1}
/input/codeControls/fitDzAlgorithm Dataset {1}
/input/codeControls/lcfsTol Dataset {1}
/input/constraints       Group
/input/constraints/diamagneticFlux Group
/input/constraints/diamagneticFlux/computed Dataset {22845}
/input/constraints/diamagneticFlux/sigma Dataset {22845}
/input/constraints/diamagneticFlux/target Dataset {22845}
/input/constraints/diamagneticFlux/weights Dataset {22845}
/input/constraints/fluxLoops Group
/input/constraints/fluxLoops/computed Dataset {22845, 36}
/input/constraints/fluxLoops/fluxLoopDim Dataset {36}
/input/constraints/fluxLoops/fluxLoopElementDim Dataset {2}
/input/constraints/fluxLoops/id Dataset {36}
/input/constraints/fluxLoops/rValues Dataset {36, 2}
/input/constraints/fluxLoops/sigmas Dataset {22845, 36}
/input/constraints/fluxLoops/target Dataset {22845, 36}
/input/constraints/fluxLoops/toroidalAngleBegin Dataset {36, 2}
/input/constraints/fluxLoops/toroidalAngleEnd Dataset {36, 2}
/input/constraints/fluxLoops/weights Dataset {22845, 36}
/input/constraints/fluxLoops/zValues Dataset {36, 2}
/input/constraints/ironModel Group
/input/constraints/ironModel/absoluteError Dataset {1}
/input/constraints/ironModel/fittingAbsoluteError Dataset {1}
/input/constraints/ironModel/fittingRelativeError Dataset {1}
/input/constraints/ironModel/geometry Group
/input/constraints/ironModel/geometry/Dang Dataset {1, 96}
/input/constraints/ironModel/geometry/Dang2 Dataset {1, 96}
/input/constraints/ironModel/geometry/Eang Dataset {1, 96}
/input/constraints/ironModel/geometry/Eang2 Dataset {1, 96}
/input/constraints/ironModel/geometry/boundaryCoordsR Dataset {1, 96}
/input/constraints/ironModel/geometry/boundaryCoordsZ Dataset {1, 96}
/input/constraints/ironModel/geometry/boundaryIntervalCount Dataset {1}
/input/constraints/ironModel/geometry/boundaryLength Dataset {1}
/input/constraints/ironModel/geometry/boundaryNodeCount Dataset {1}
/input/constraints/ironModel/geometry/boundaryNodeDim Dataset {96}
</pre>
</div>
</div>


<div id="outline-container-org45708df" class="outline-3">
<h3 id="org45708df">Printing detailed information with <code>h5dump</code></h3>
<div class="outline-text-3" id="text-org45708df">
<p>
The <code>h5dump</code> command line tool lists detailed information about objects in an
HDF5 file. There is no difference in the behavior of <code>h5dump</code> between listing
information about objects in an HDF5 file that is stored in a local
file system vs. HDFS. There currently one additional required argument,
<code>--filedriver=hdfs</code> to tell <code>h5dump</code> to use the HDFS VFD instead of the
default POSIX VFD. Unless the HDFS file system is running on <code>localhost</code>, it
is also necessary to specify the host name and port number of the HDFS
namenode.
</p>

<div class="org-src-container">
<pre class="src src-shell">h5dump --filedriver=hdfs <span style="color: #008000;">\</span>
       --hdfs-attrs=<span style="color: #008000;">"(hdfs://jelly.ad.hdfgroup.org,8020,,,)"</span> <span style="color: #008000;">\</span>
       -pB <span style="color: #008000;">\</span>
       /tmp/sample.h5
</pre>
</div>

<pre class="example">

&gt; &gt; HDF5 "/tmp/sample.h5" {
SUPER_BLOCK {
   SUPERBLOCK_VERSION 0
   FREELIST_VERSION 0
   SYMBOLTABLE_VERSION 0
   OBJECTHEADER_VERSION 0
   OFFSET_SIZE 8
   LENGTH_SIZE 8
   BTREE_RANK 16
   BTREE_LEAF 4
   ISTORE_K 32
   FILE_SPACE_STRATEGY H5F_FSPACE_STRATEGY_FSM_AGGR
   FREE_SPACE_PERSIST FALSE
   FREE_SPACE_SECTION_THRESHOLD 1
   FILE_SPACE_PAGE_SIZE 4096
   USER_BLOCK {
      USERBLOCK_SIZE 0
   }
}
GROUP "/" {
   GROUP "A" {
      GROUP "few" {
         GROUP "groups" {
         }
      }
   }
}
}
</pre>

<p>
A slightly more complex example is shown below:
</p>

<div class="org-src-container">
<pre class="src src-shell">h5dump --filedriver=hdfs <span style="color: #008000;">\</span>
       --hdfs-attrs=<span style="color: #008000;">"(hdfs://jelly.ad.hdfgroup.org,8020,,,)"</span> <span style="color: #008000;">\</span>
       -pBH /tmp/efitOut.nc | head -n 50
</pre>
</div>

<pre class="example">

&gt; HDF5 "/tmp/efitOut.nc" {
SUPER_BLOCK {
   SUPERBLOCK_VERSION 2
   FREELIST_VERSION 0
   SYMBOLTABLE_VERSION 0
   OBJECTHEADER_VERSION 0
   OFFSET_SIZE 8
   LENGTH_SIZE 8
   BTREE_RANK 16
   BTREE_LEAF 4
   ISTORE_K 32
   FILE_SPACE_STRATEGY H5F_FSPACE_STRATEGY_FSM_AGGR
   FREE_SPACE_PERSIST FALSE
   FREE_SPACE_SECTION_THRESHOLD 1
   FILE_SPACE_PAGE_SIZE 4096
   USER_BLOCK {
      USERBLOCK_SIZE 0
   }
}
GROUP "/" {
   ATTRIBUTE "Conventions" {
      DATATYPE  H5T_STRING {
         STRSIZE 20;
         STRPAD H5T_STR_NULLTERM;
         CSET H5T_CSET_ASCII;
         CTYPE H5T_C_S1;
      }
      DATASPACE  SCALAR
   }
   ATTRIBUTE "codeVersion" {
      DATATYPE  H5T_STRING {
         STRSIZE 11;
         STRPAD H5T_STR_NULLTERM;
         CSET H5T_CSET_ASCII;
         CTYPE H5T_C_S1;
      }
      DATASPACE  SCALAR
   }
   ATTRIBUTE "pulseNumber" {
      DATATYPE  H5T_STD_I32LE
      DATASPACE  SIMPLE { ( 1 ) / ( 1 ) }
   }
   DATATYPE "coords" H5T_COMPOUND {
      H5T_IEEE_F64LE "R";
      H5T_IEEE_F64LE "Z";
   }
   DATASET "equilibriumStatus" {
      DATATYPE  "/equilibriumStatusType"
      DATASPACE  SIMPLE { ( 22845 ) / ( 22845 ) }
      STORAGE_LAYOUT {
</pre>
</div>
</div>
