hdfs-demo.html


<div id="outline-container-orgbb01200" class="outline-3">
<h3 id="orgbb01200">Extracting data from a dataset with <code>h5dump</code></h3>
<div class="outline-text-3" id="text-orgbb01200">
<p>
For a full list of <code>h5dump</code> options run <code>h5dump -h</code>.
The <code>h5dump</code> command to extract a 10 by 10 block (<code>-s "0,0'" -k "10,10"</code>) of
elements from a two-dimensional dataset is shown below:
</p>

<div class="org-src-container">
<pre class="src src-shell">h5dump --filedriver=hdfs <span style="color: #008000;">\</span>
       --hdfs-attrs=<span style="color: #008000;">"(hdfs://jelly.ad.hdfgroup.org,8020,,,)"</span> <span style="color: #008000;">\</span>
       -d /output/fluxFunctionProfiles/poloidalFluxArea <span style="color: #008000;">\</span>
       -s <span style="color: #008000;">"0,0"</span> -k <span style="color: #008000;">"10,10"</span> <span style="color: #008000;">\</span>
    /tmp/efitOut.nc
</pre>
</div>

<pre class="example">

&gt; &gt; &gt; HDF5 "/tmp/efitOut.nc" {
DATASET "/output/fluxFunctionProfiles/poloidalFluxArea" {
   DATATYPE  H5T_IEEE_F64LE
   DATASPACE  SIMPLE { ( 22845, 33 ) / ( 22845, 33 ) }
   SUBSET {
      START ( 0, 0 );
      STRIDE ( 1, 1 );
      COUNT ( 1, 1 );
      BLOCK ( 10, 10 );
      DATA {
      (0,0): 0, 0.105177, 0.211194, 0.317949, 0.425508, 0.53394, 0.643315,
      (0,7): 0.753705, 0.865191, 0.97786,
      (1,0): 0, 0.102888, 0.206772, 0.311557, 0.417309, 0.524091, 0.631973,
      (1,7): 0.741024, 0.851326, 0.962959,
      (2,0): 0, 0.104089, 0.209173, 0.315166, 0.422121, 0.53011, 0.639202,
      (2,7): 0.749467, 0.860991, 0.973854,
      (3,0): 0, 0.10498, 0.210948, 0.317801, 0.425605, 0.534427, 0.644339,
      (3,7): 0.755412, 0.867731, 0.981378,
      (4,0): 0, 0.10605, 0.213064, 0.320959, 0.429793, 0.539632, 0.65055,
      (4,7): 0.76262, 0.875928, 0.990556,
      (5,0): 0, 0.108181, 0.217261, 0.327153, 0.437919, 0.549636, 0.66237,
      (5,7): 0.776199, 0.891211, 1.00749,
      (6,0): 0, 0.107151, 0.215293, 0.324331, 0.43433, 0.545359, 0.65749,
      (6,7): 0.7708, 0.885371, 1.00129,
      (7,0): 0, 0.110211, 0.22127, 0.33308, 0.445711, 0.559235, 0.673728,
      (7,7): 0.789269, 0.905944, 1.02384,
      (8,0): 0, 0.112895, 0.226538, 0.340842, 0.455874, 0.571715, 0.688438,
      (8,7): 0.806128, 0.924873, 1.04476,
      (9,0): 0, 0.112122, 0.225054, 0.338708, 0.453155, 0.568472, 0.68473,
      (9,7): 0.802015, 0.920413, 1.04001
      }
   }
   ATTRIBUTE "DIMENSION_LIST" {
      DATATYPE  H5T_VLEN { H5T_REFERENCE { H5T_STD_REF_OBJECT }}
      DATASPACE  SIMPLE { ( 2 ) / ( 2 ) }
      DATA {
      (0): (DATASET 9769 /time ),
      (1): (DATASET 240402 /output/fluxFunctionProfiles/normalizedPoloidalFlux )
      }
   }
   ATTRIBUTE "_FillValue" {
      DATATYPE  H5T_IEEE_F64LE
      DATASPACE  SIMPLE { ( 1 ) / ( 1 ) }
      DATA {
      (0): nan
      }
   }
   ATTRIBUTE "title" {
      DATATYPE  H5T_STRING {
         STRSIZE 16;
         STRPAD H5T_STR_NULLTERM;
         CSET H5T_CSET_ASCII;
         CTYPE H5T_C_S1;
      }
      DATASPACE  SCALAR
      DATA {
      (0): "poloidalFluxArea"
      }
   }
   ATTRIBUTE "units" {
      DATATYPE  H5T_STRING {
         STRSIZE 3;
         STRPAD H5T_STR_NULLTERM;
         CSET H5T_CSET_ASCII;
         CTYPE H5T_C_S1;
      }
      DATASPACE  SCALAR
      DATA {
      (0): "m^2"
      }
   }
}
}
</pre>
</div>
</div>
