hdfs-demo.org
* Summary

  The HDF5 VFD for HDFS provides transparent /read access/ to HDF5 files stored
  in HDFS file systems. No code changes other than loading the HDFS VFD and
  linking against an updated version of the HDF5 library are required,
  This applies to the HDF5 command line tools as well as existing applications.
  You can use this VFD to bulk process HDF5 (and NetCDF-4) files stored in
  HDFS with frameworks such as Hadoop streaming.
